{
    "entries": [
        {
            "id": "6",
            "title": "It Begins...",
            "show": "true",
            "showOnDate": "3/7/2021 18:29",
            "writtenDate": "3/7/2021 18:29",
            "tags": [
                "garden",
                "home",
                "Spring",
                "planting"
            ],
            "content": [
                "Last year when Covid hit and most of us found ourselves working at home, my wife, a school teacher, and I started a garden. It became one of the things that we both found ourselves looking forward to daily.  Now a year later, and we began our planning for this year's garden!",
                "The excitement and anticipation of the Cater Garden 2021, is upon us! We look forward to Spring and the days ahead!",
                "Below is a just one of many Sunflowers from last years garden!",
                "<img src=\"images/reflections/sunflower2020.png\" style=\"width:400px; height:300px;\"/>"
            ]
        },
        {
            "id": "5",
            "title": "JSON, Electron, Vue, and a Static Blog ",
            "show": false,
            "showOnDate": null,
            "writtenDate": "3/6/2021 8:00",
            "tags": [
                "blog",
                " json",
                " electron",
                " vue"
            ],
            "content": [
                "I have analyzed and studied to death the arguments for and against using Electron to develop software. I understand perspectives on both side of the argument! My first computer language was C. My first compiler I touched was Borland's Turbo C 1.0. Disk space and memory back then weren't cheap or as easy to come by.",
                "Fast forward thirty years and I find myself wanting a software tool that I can use on Windows or Mac. I have tinkered with C#.Net and GTK, and Java / JavaFX. Both are really nice frameworks and tools. To provide some context, I work in C#.Net and Angular at my day job. I spend a fair amount of my day in Microsoft's Electron based VSCode. ",
                "With that in mind, I decided give Electron a try. I wanted to see how easily and fast could I crank out something I could use to update a JSON data file containing my static blog entries.",
                "The short answer to my question is probably not what the Electron haters want to hear. Development time was fast because I already knew javascript. Documentation on the Electron site is easy to search and find what I needed when I had a question. Build and execution were quick.",
                "For my work I developed some of the code on both a Early 2015 Mac Book Pro 13 inch with I5 Intel CPU and 8GB RAM, and on a Dell Windows 10 with Intel I3 with 8GB RAM. I used VSCode to write the utility. NodeJS and Electron were easily setup on both platforms. I used Electron Packager to build the application.",
                "The structure of my JSON object is as follows.<code><br/>{<br/>\"entries\": [{<br/>    \"id\": 1,<br/>    \"title\": \"Entry Title\",<br/>    \"writtenDate\": \"12-27-2020 10:15\",<br/>    \"content\": [<br/>    \"Content line 1\",<br/>    \"Content lines may contain html tags, etc.\",<br/>    \"One more content line\"<br/>      ],<br/>     \"tags\": [\"blog\",\"2021\",\"post tag\",\"tag\"],<br/>     \"show\": true,<br/>     \"showOnDate\": null\n<br/> }],\n<br/> \"recordIndex\": 99\n<br/>}</code>\n\n",
                "On my website within the Reflection section, I used Vue more like frontend developers used jQuery back in the day -- non-SPA (Single Page App) mode! This works very well from my perspective. ",
                "Vue is used to fetch the JSON entries and present a defined limit of three posts per page.  The show flag shown in the JSON above is used along with the ShowOnDate value to determine if we should show an entry. Using these two values we can add a post and have it display in the future. ",
                "I plan to post the source code to GitHub for what I have named the 'Static Blog Tool'. It is not fancied up with CSS. It is functional and is a first version pass. I am sure new functionality will be added as I have need. I will also work to provide some Vue/HTML stuff once I have stripped out personal styling from my site."
            ]
        },
        {
            "id": "4",
            "title": "Illustrations in progress...",
            "show": "true",
            "showOnDate": null,
            "writtenDate": "01-01-2021 8:50pm",
            "tags": [
                "children's",
                "book",
                "illustration",
                "author"
            ],
            "content": [
                "Last year I wrote a little poem <img src=\"images/reflections/childrensbook.jpg\" style=\"width:180px; padding:8px; float:right;\"> from the perspective of my youngest grandson. My family and some friends fell in love with the story.",
                "I started sketching and watercoloring the illustrations for it. After working through a number of the illustrations, I shared electronic copies of the work with a few folks. The illustrations were well received, but I wanted to do a little better. The holidays came, and I got busy with my day job, so I put the illustration work on hold.",
                "I am hoping to get the illustrations completed in the early part of the first quarter of 2021! I am excited about this project and I look forward to sharing it. ",
                "All the best to you this year!!!",
                "--Wayne"
            ]
        },
        {
            "id": 3,
            "title": "I Still Love You (Acoustic version)",
            "writtenDate": "12-27-2020 3:47pm",
            "content": [
                "Back on October 15, 2020, I recorded this acoustic version of my song, <a href=\"https://www.amazon.com/dp/B073X3YYJL/ref=dm_ws_tlw_trk5\" target=\"_blank\">I Still Love You</a>, on Facebook. A few people listened and responded. Fast forward to December 2020, and for some reason, people are now seeing it and responding to it. Laughingly, I say \"Who can understand the Facebook algorithms?\"",
                "<iframe src=\"https://www.facebook.com/plugins/video.php?height=225&href=https%3A%2F%2Fwww.facebook.com%2Fwayne.cater%2Fvideos%2F10218533184626446%2F&show_text=false&width=350\" width=\"350\" height=\"225\" style=\"border:none;overflow:hidden\" scrolling=\"no\" frameborder=\"0\" allowfullscreen=\"true\" allow=\"autoplay; clipboard-write; encrypted-media; picture-in-picture; web-share\" allowFullScreen=\"true\"></iframe>"
            ],
            "tags": [
                "music",
                "acoustic",
                "songwriting",
                "facebook",
                "video"
            ],
            "show": true,
            "showOnDate": null
        },
        {
            "id": 2,
            "title": "Art & Piano (YouTube)",
            "writtenDate": "12-27-2020 10:55am",
            "content": [
                "This short video was made in June 2018. It shows some of my art work progression and features a little music I wrote and recorded.",
                "If you are interested in my art work be sure to check out my instagram page! You can follow me here: <a href=\"https://www.instagram.com/bwcater/\" target=\"_blank\">instagram.com/bwcater</a>",
                "<iframe width=\"350\" height=\"225\" src=\"https://www.youtube.com/embed/de7EFor4UOw\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>",
                " "
            ],
            "tags": [
                "art",
                "watercolor",
                "draw",
                "sketch",
                "piano"
            ],
            "show": true,
            "showOnDate": null
        },
        {
            "id": 1,
            "title": "The Plan",
            "writtenDate": "12-27-2020 10:15am",
            "content": [
                "The page you are presently viewing uses <a href=\"https://vuejs.org/\" target=\"_blank\">Vue</a> to power the static blog like system.  A couple of years back, I was introduced to Vue while working for a Nashville based consulting firm. I went on to work heavily in Angular, but always looked back fondly at Vue. Today I am back working again with Vue.",
                "I have tinkered with some of the more popular static site engines like Jekyll and Hugo.  They offer some great features and power. I am also aware of VuePress. While what I have put together here is not as feature rich, it meets what I wanted and needed.",
                "The plan is to use this section, Reflections, to share my songs, art, and thoughts. I hope you will find useful stuff that will make you want to come along for the journey.",
                "<br/><b>Special Note:</b> More recent posts will be shown from top to bottom; also you can click the title to view the specific reflection in its own page."
            ],
            "tags": [
                "blog",
                "2020",
                "first post",
                "vue"
            ],
            "show": true,
            "showOnDate": null
        }
    ],
    "recordIndex": 7
}